kossnikita/at32f4xx-pac/src/at32f437/at32f437.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x40020400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <baseAddress>0x40020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD</name>
      <baseAddress>0x40020C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE</name>
      <baseAddress>0x40021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <baseAddress>0x40021400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG</name>
      <baseAddress>0x40021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH</name>
      <baseAddress>0x40021C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>EXINT</description>
      <groupName>EXINT</groupName>
      <baseAddress>0x40013C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EXINT0</name>
        <description>EXINT Line0 interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXINT1</name>
        <description>EXINT Line1 interrupt</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>EXINT2</name>
        <description>EXINT Line2 interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>EXINT3</name>
        <description>EXINT Line3 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>EXINT4</name>
        <description>EXINT Line4 interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>EXINT9_5</name>
        <description>EXINT Line[9:5] interrupts</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>EXINT15_10</name>
        <description>EXINT Line[15:10] interrupts</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>PVM</name>
        <description>PVM interrupt connect to EXINT line16</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>ERTCALARM</name>
        <description>ERTC Alarm interrupt connect to EXINT line17</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>OTGFS1_WKUP</name>
        <description>OTGFS1_WKUP interrupt connect to EXINT line18</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>EMAC_WKUP</name>
        <description>EMAC_WKUP interrupt connect to EXINT line19</description>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>OTGFS2_WKUP</name>
        <description>OTGFS2_WKUP interrupt connect to EXINT line20</description>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>TAMPER</name>
        <description>Tamper interrupt connect to EXINT line21</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>ERTC_WKUP</name>
        <description>ERTC Global interrupt connect to EXINT line22</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>INTEN</name>
          <displayName>INTEN</displayName>
          <description>Interrupt enable register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEN0</name>
              <description>Interrupt enable or disable on line 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN1</name>
              <description>Interrupt enable or disable on line 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN2</name>
              <description>Interrupt enable or disable on line 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN3</name>
              <description>Interrupt enable or disable on line 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN4</name>
              <description>Interrupt enable or disable on line 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN5</name>
              <description>Interrupt enable or disable on line 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN6</name>
              <description>Interrupt enable or disable on line 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN7</name>
              <description>Interrupt enable or disable on line 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN8</name>
              <description>Interrupt enable or disable on line 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN9</name>
              <description>Interrupt enable or disable on line 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN10</name>
              <description>Interrupt enable or disable on line 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN11</name>
              <description>Interrupt enable or disable on line 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN12</name>
              <description>Interrupt enable or disable on line 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN13</name>
              <description>Interrupt enable or disable on line 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN14</name>
              <description>Interrupt enable or disable on line 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN15</name>
              <description>Interrupt enable or disable on line 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN16</name>
              <description>Interrupt enable or disable on line 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN17</name>
              <description>Interrupt enable or disable on line 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN18</name>
              <description>Interrupt enable or disable on line 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN19</name>
              <description>Interrupt enable or disable on line 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN20</name>
              <description>Interrupt enable or disable on line 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN21</name>
              <description>Interrupt enable or disable on line 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN22</name>
              <description>Interrupt enable or disable on line 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTEN</name>
          <displayName>EVTEN</displayName>
          <description>Event enable register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVTEN0</name>
              <description>Event enable or disable on line 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN1</name>
              <description>Event enable or disable on line 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN2</name>
              <description>Event enable or disable on line 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN3</name>
              <description>Event enable or disable on line 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN4</name>
              <description>Event enable or disable on line 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN5</name>
              <description>Event enable or disable on line 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN6</name>
              <description>Event enable or disable on line 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN7</name>
              <description>Event enable or disable on line 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN8</name>
              <description>Event enable or disable on line 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN9</name>
              <description>Event enable or disable on line 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN10</name>
              <description>Event enable or disable on line 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN11</name>
              <description>Event enable or disable on line 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN12</name>
              <description>Event enable or disable on line 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN13</name>
              <description>Event enable or disable on line 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN14</name>
              <description>Event enable or disable on line 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN15</name>
              <description>Event enable or disable on line 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN16</name>
              <description>Event enable or disable on line 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN17</name>
              <description>Event enable or disable on line 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN18</name>
              <description>Event enable or disable on line 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN19</name>
              <description>Event enable or disable on line 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN20</name>
              <description>Event enable or disable on line 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN21</name>
              <description>Event enable or disable on line 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVTEN22</name>
              <description>Event enable or disable on line 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POLCFG1</name>
          <displayName>POLCFG1</displayName>
          <description>Rising polarity configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RP0</name>
              <description>Rising polarity configuration bit of line 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP1</name>
              <description>Rising polarity configuration bit of line 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP2</name>
              <description>Rising polarity configuration bit of line 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP3</name>
              <description>Rising polarity configuration bit of line 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP4</name>
              <description>Rising polarity configuration bit of line 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP5</name>
              <description>Rising polarity configuration bit of line 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP6</name>
              <description>Rising polarity configuration bit of linee 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP7</name>
              <description>Rising polarity configuration bit of line 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP8</name>
              <description>Rising polarity configuration bit of line 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP9</name>
              <description>Rising polarity configuration bit of line 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP10</name>
              <description>Rising polarity configuration bit of line 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP11</name>
              <description>Rising polarity configuration bit of line 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP12</name>
              <description>Rising polarity configuration bit of line 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP13</name>
              <description>Rising polarity configuration bit of line 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP14</name>
              <description>Rising polarity configuration bit of line 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP15</name>
              <description>Rising polarity configuration bit of line 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP16</name>
              <description>Rising polarity configuration bit of line 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP17</name>
              <description>Rising polarity configuration bit of line 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP18</name>
              <description>Rising polarity configuration bit of line 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP19</name>
              <description>Rising polarity configuration bit of line 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP20</name>
              <description>Rising polarity configuration bit of line 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP21</name>
              <description>Rising polarity configuration bit of line 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RP22</name>
              <description>Rising polarity configuration bit of line 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
