kossnikita/at32f4xx-pac/src/at32f437/at32f437.svd
        <register>
          <name>SWEVT</name>
          <displayName>SWEVT</displayName>
          <description>Software event register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BRKSWTR</name>
              <description>Brake event triggered by software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <name>BRKSWTRW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Generate a break event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSWTR</name>
              <description>Trigger event triggered by software</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <name>TRGSWTRW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Generate a trigger event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALLSWTR</name>
              <description>HALL event triggered by software</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <name>HALLSWTRW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Generate a HALL event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>C%sSWTR</name>
              <description>Channel %s event triggered by software</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <name>C1SWTRW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Generate a channel event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVFSWTR</name>
              <description>Overflow event triggered by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <name>OVFSWTRW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Overflow</name>
                  <description>Generate an overflow event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1_OUTPUT</name>
          <displayName>CM1_OUTPUT</displayName>
          <description>Channel output mode register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <name>C%sOSEN</name>
              <description>Channel %s output switch enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C1OSENR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CxORAW is not affected by EXT input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Once a high level is detect on EXT input, clear CxORAW</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>C1OSENW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>CxORAW is not affected by EXT input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Once a high level is detect on EXT input, clear CxORAW</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <name>C%sOCTRL</name>
              <description>Channel %s output control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>C1OCTRL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnected. CxORAW is disconnected from CxOUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>CxORAW is high when TMRx_CVAL=TMRx_CxDT</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>CxORAW is low when TMRx_CVAL=TMRx_CxDT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Toggle</name>
                  <description>Switch CxORAW level when TMRx_CVAL=TMRx_CxDT</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceLow</name>
                  <description>CxORAW is forced low</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceHigh</name>
                  <description>CxORAW is forced high</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_A</name>
                  <description>PWM mode A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_B</name>
                  <description>PWM mode B</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <name>C%sOBEN</name>
              <description>Channel %s output buffer enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C1OBENR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Channel output buffer is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Channel output buffer is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>C1OBENW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Channel output buffer disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Channel output buffer enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <name>C%sOIEN</name>
              <description>Channel %s output immediately enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C1OIEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Compare</name>
                  <description>Need to compare the CVAL with CxDT before generating an output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Immediately</name>
                  <description>No need to compare the CVAL and CxDT. An output is generated immediately when a trigger event occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C2C</name>
              <description>Channel 2 configure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C2C</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Output</name>
                  <description>C2IN channel is configured as output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C2IFP2</name>
                  <description>Input, C2IN is mapped on C2IFP2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1IFP2</name>
                  <description>Input, C2IN is mapped on C1IFP2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIS</name>
                  <description>Input, C2IN is mapped on STCI. This mode works only when the internal trigger input is selected by STIS.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1C</name>
              <description>Channel 1 configure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C1C</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Output</name>
                  <description>C1IN channel is configured as output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1IFP1</name>
                  <description>Input, C1IN is mapped on C1IFP1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C2IFP1</name>
                  <description>Input, C1IN is mapped on C2IFP1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIS</name>
                  <description>Input, C1IN is mapped on STCI. This mode works only when the internal trigger input is selected by STIS.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1_INPUT</name>
          <displayName>CM1_INPUT</displayName>
          <description>Channel input mode register 1</description>
          <alternateRegister>CM1_OUTPUT</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>C2DF</name>
              <description>Channel 2 digital filter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues derivedFrom="C1DF.C1DF"/>
            </field>
            <field>
              <name>C2IDIV</name>
              <description>Channel 2 input divider</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="C1IDIV.C1IDIV"/>
            </field>
            <field>
              <name>C2C</name>
              <description>Channel 2 configure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C2C</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Output</name>
                  <description>C2IN channel is configured as output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C2IFP2</name>
                  <description>Input, C2IN is mapped on C2IFP2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1IFP2</name>
                  <description>Input, C2IN is mapped on C1IFP2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIS</name>
                  <description>Input, C2IN is mapped on STCI. This mode works only when the internal trigger input is selected by STIS.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1DF</name>
              <description>Channel 1 digital filter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>C1DF</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NoFilter</name>
                  <description>No filter, sampling is done at f_DTS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N2</name>
                  <description>f_sampling = f_DTS, N=2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N4</name>
                  <description>f_sampling = f_DTS, N=4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N8</name>
                  <description>f_sampling = f_DTS, N=8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div2N6</name>
                  <description>f_sampling = f_DTS/2, N=6</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div2N8</name>
                  <description>f_sampling = f_DTS/2, N=8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div4N6</name>
                  <description>f_sampling = f_DTS/4, N=6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div4N8</name>
                  <description>f_sampling = f_DTS/4, N=8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8N6</name>
                  <description>f_sampling = f_DTS/8, N=6</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8N8</name>
                  <description>f_sampling = f_DTS/8, N=8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16N5</name>
                  <description>f_sampling = f_DTS/16, N=5</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16N6</name>
                  <description>f_sampling = f_DTS/16, N=6</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16N8</name>
                  <description>f_sampling = f_DTS/16, N=8</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32N5</name>
                  <description>f_sampling = f_DTS/32, N=5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32N6</name>
                  <description>f_sampling = f_DTS/32, N=6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32N8</name>
                  <description>f_sampling = f_DTS/32, N=8</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1IDIV</name>
              <description>Channel 1 input divider</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C1IDIV</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Every</name>
                  <description>No divider. An input capture is generated at each active edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>An input compare is generated every 2 active edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>An input compare is generated every 4 active edges</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>An input compare is generated every 8 active edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1C</name>
              <description>Channel 1 configure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C1C</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Output</name>
                  <description>C1IN channel is configured as output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1IFP1</name>
                  <description>Input, C1IN is mapped on C1IFP1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C2IFP1</name>
                  <description>Input, C1IN is mapped on C2IFP1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIS</name>
                  <description>Input, C1IN is mapped on STCI. This mode works only when the internal trigger input is selected by STIS.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
